newwms_gift/src/Catalogs/ПользовательскиРегламентныеЗадания/ПользовательскиРегламентныеЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПользовательскиРегламентныеЗадания</name>
  <attributes>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПовтораВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническоеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

newwms_gift/src/InformationRegisters/ИсполнениеПользовательскихРегламентныхЗаданий/ИсполнениеПользовательскихРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнениеПользовательскихРегламентныхЗаданий</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияИсполненияПользовательскихЗаданий</types>
    </type>
  </resources>
  <resources>
    <name>ТекущийКлюч</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланируемогоПовтора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>CatalogRef.ПользовательскиРегламентныеЗадания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Catalogs/ПользовательскиРегламентныеЗадания/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	Если не Использовать Тогда
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Набор=РегистрыСведений.ИсполнениеПользовательскихРегламентныхЗаданий.СоздатьНаборЗаписей();
		Набор.Отбор.Задание.Установить(Ссылка);
		Набор.Прочитать();
		Для Каждого стр из Набор Цикл 
			стр.ПризнакУдаления=Истина;
		КонецЦикла;
		Набор.Записать();
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры
Процедура БлокировкаПоПользовательскомуЗаданию()
	БлокировкаДанных=новый БлокировкаДанных;
	ЭлементБлокировки=БлокировкаДанных.Добавить("РегистрСведений.ИсполнениеПользовательскихРегламентныхЗаданий");
	ЭлементБлокировки.Режим=РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Задание",Ссылка);
	БлокировкаДанных.Заблокировать();

	КонецПроцедуры
